fQwQf/A20OS/kernel/platform/stm32f103/bluetooth.c
#ifdef CONFIG_BOARD_STM32F103

#include "stm32_bluetooth_config.h"
#include "bluetooth.h"
#include "core/arch.h"
#include "core/stdio.h"
#include "stm32_uart.h"

#define RCC_APB2ENR (*(volatile uint32_t *)0x40021018UL)
#define AFIO_MAPR   (*(volatile uint32_t *)0x40010004UL)

#define GPIOA_CRL  (*(volatile uint32_t *)0x40010800UL)
#define GPIOA_CRH  (*(volatile uint32_t *)0x40010804UL)
#define GPIOA_IDR  (*(volatile uint32_t *)0x40010808UL)
#define GPIOA_BSRR (*(volatile uint32_t *)0x40010810UL)
#define GPIOA_BRR  (*(volatile uint32_t *)0x40010814UL)
#define GPIOB_CRL  (*(volatile uint32_t *)0x40010C00UL)
#define GPIOB_CRH  (*(volatile uint32_t *)0x40010C04UL)
#define GPIOB_IDR  (*(volatile uint32_t *)0x40010C08UL)
#define GPIOB_BSRR (*(volatile uint32_t *)0x40010C10UL)
#define GPIOB_BRR  (*(volatile uint32_t *)0x40010C14UL)

#define RCC_APB2ENR_AFIOEN  (1U << 0)
#define RCC_APB2ENR_IOPAEN  (1U << 2)
#define RCC_APB2ENR_IOPBEN  (1U << 3)

#define AFIO_MAPR_SWJ_CFG_MASK (7U << 24)
#define AFIO_MAPR_SWJ_NOJTAG   (2U << 24)

#define BLUETOOTH_KEY_PIN   4U
#define BLUETOOTH_STATE_PIN 15U
#ifndef STM32_BLUETOOTH_BAUD_RATE
#define STM32_BLUETOOTH_BAUD_RATE 9600U
#endif
#ifndef STM32_BLUETOOTH_BAUD_RATE_TEXT
#define STM32_BLUETOOTH_BAUD_RATE_TEXT "9600"
#endif
#define BLUETOOTH_BAUD_RATE STM32_BLUETOOTH_BAUD_RATE
#define BLUETOOTH_RX_SIZE   256U
#define BLUETOOTH_FRAME_IDLE_MS 20U
#define BLUETOOTH_TX_TIMEOUT 100000U
#define BLUETOOTH_AT_TIMEOUT_MS 500U
#define BLUETOOTH_AT_PROBE_TIMEOUT_MS 350U
#define BLUETOOTH_AT_RETRIES 3U
#define BLUETOOTH_BOOT_DELAY_MS 1500U
#define BLUETOOTH_RESET_DELAY_MS 1000U
#define BLUETOOTH_KEY_SETUP_MS 10U
#define BLUETOOTH_CONNECT_ASSERT_MS 500U
#define BLUETOOTH_DISCONNECT_ASSERT_MS 200U
#define BLUETOOTH_AT_RESPONSE_MAX 96U
#define BLUETOOTH_INIT_RETRIES 3U
#define BLUETOOTH_INIT_RETRY_DELAY_MS 1000U
#define BLUETOOTH_RESET_ENTER_AT_TIMEOUT_MS 2000U

static volatile uint8_t bluetooth_rx[BLUETOOTH_RX_SIZE];
static volatile unsigned bluetooth_rx_head;
static volatile unsigned bluetooth_rx_tail;
static volatile int bluetooth_frame_ready;
static stm32_bluetooth_info_t bluetooth;
static uint32_t bluetooth_observed_rx;
static uint64_t bluetooth_last_rx_time;
static uint64_t bluetooth_state_changed_time;
static int bluetooth_state_high;
static int bluetooth_at_key_mode;
static uint32_t bluetooth_uart_baud;

#ifdef CONFIG_STM32_XUANWU
static void gpio_config_pin(volatile uint32_t *crl, volatile uint32_t *crh,
                            unsigned pin, uint32_t mode);

static int bluetooth_uart_send_byte(uint8_t value) {
    return stm32_uart_send_byte(
        STM32_UART_USART3, value, BLUETOOTH_TX_TIMEOUT);
}

static void bluetooth_copy_text(char *dest, size_t capacity,
                                const char *source) {
    size_t i = 0;

    if (capacity == 0)
        return;
    if (source) {
        while (i + 1U < capacity && source[i]) {
            dest[i] = source[i];
            i++;
        }
    }
    dest[i] = '\0';
}

static int bluetooth_text_equal(const char *left, const char *right) {
    if (!left || !right)
        return 0;
    while (*left && *right && *left == *right) {
        left++;
        right++;
    }
    return *left == '\0' && *right == '\0';
}

static uint16_t bluetooth_parse_uuid(const char *text, int *valid) {
    uint32_t value = 0;
    unsigned digits = 0;

    if (valid)
        *valid = 0;
    if (!text)
        return 0;
    if (text[0] == '0' && (text[1] == 'x' || text[1] == 'X'))
        text += 2;
    while (*text) {
        unsigned digit;
        if (*text >= '0' && *text <= '9')
            digit = (unsigned)(*text - '0');
        else if (*text >= 'a' && *text <= 'f')
            digit = (unsigned)(*text - 'a') + 10U;
        else if (*text >= 'A' && *text <= 'F')
            digit = (unsigned)(*text - 'A') + 10U;
        else
            return 0;
        if (++digits > 4U)
            return 0;
        value = (value << 4) | digit;
        text++;
    }
    if (digits == 0U)
        return 0;
    if (valid)
        *valid = 1;
    return (uint16_t)value;
}

static void bluetooth_key_set(int high) {
    if (high)
        GPIOA_BSRR = 1U << BLUETOOTH_KEY_PIN;
    else
        GPIOA_BRR = 1U << BLUETOOTH_KEY_PIN;
}

static void bluetooth_delay_ms(unsigned ms) {
    while (ms--) {
        for (volatile unsigned i = 0; i < 1600U; i++)
            __asm__ __volatile__("nop");
    }
}

static void bluetooth_uart_set_baud(uint32_t baud_rate) {
    if (stm32_uart_set_baud(STM32_UART_USART3, baud_rate) == 0)
        bluetooth_uart_baud = baud_rate;
}

static void bluetooth_uart_flush(void) {
    stm32_uart_drain_rx(STM32_UART_USART3);
}

static int bluetooth_rx_line_is_present(int state) {
    return state == STM32_BLUETOOTH_RX_DRIVEN_HIGH ||
           state == STM32_BLUETOOTH_RX_DRIVEN_LOW;
}

static int bluetooth_probe_rx_line(void) {
    gpio_config_pin(&GPIOB_CRL, &GPIOB_CRH, 11U, 0x8U);
    GPIOB_BSRR = 1U << 11;
    bluetooth_delay_ms(5U);
    int pull_up_read = !!(GPIOB_IDR & (1U << 11));
    GPIOB_BRR = 1U << 11;
    bluetooth_delay_ms(5U);
    int pull_down_read = !!(GPIOB_IDR & (1U << 11));
    gpio_config_pin(&GPIOB_CRL, &GPIOB_CRH, 11U, 0x4U);

    if (pull_up_read && pull_down_read)
        return STM32_BLUETOOTH_RX_DRIVEN_HIGH;
    if (pull_up_read && !pull_down_read)
        return STM32_BLUETOOTH_RX_FLOATING;
    if (!pull_up_read && !pull_down_read)
        return STM32_BLUETOOTH_RX_DRIVEN_LOW;
    return STM32_BLUETOOTH_RX_UNKNOWN;
}

static int bluetooth_response_contains(const char *response,
                                       const char *needle) {
    if (!response || !needle || !*needle)
        return 0;

    for (size_t i = 0; response[i]; i++) {
        size_t j = 0;
        while (needle[j] && response[i + j] == needle[j])
            j++;
        if (!needle[j])
            return 1;
    }
    return 0;
}

static void bluetooth_log_response(const char *command, const char *response,
                                   size_t length, int key_mode,
                                   uint32_t error_bytes) {
    const char *key_name =
        key_mode == STM32_BLUETOOTH_AT_KEY_PULSE ? "pulse" :
        key_mode == STM32_BLUETOOTH_AT_KEY_HIGH ? "high" : "low";
    printf("[BT-AT] baud=%u key=%s cmd=",
           (unsigned)bluetooth_uart_baud,
           key_name);
    for (size_t i = 0; command && command[i]; i++) {
        char c = command[i];
        if (c == '\r')
            printf("\\r");
        else if (c == '\n')
            printf("\\n");
        else if (c >= 32 && c <= 126)
            printf("%c", c);
        else
            printf("\\x%02x", (unsigned)(uint8_t)c);
    }
    printf(" reply=");
    if (length == 0) {
        printf("<none>");
    } else {
        for (size_t i = 0; i < length; i++) {
            char c = response[i];
            if (c == '\r')
                printf("\\r");
            else if (c == '\n')
                printf("\\n");
            else if (c >= 32 && c <= 126)
                printf("%c", c);
            else
                printf("\\x%02x", (unsigned)(uint8_t)c);
        }
    }
    printf(" bytes=%u errors=%u\n",
           (unsigned)length, (unsigned)error_bytes);
}

static int bluetooth_response_value(const char *response, const char *key,
                                    char *value, size_t capacity) {
    if (!response || !key || !value || capacity < 2U)
        return 0;

    for (size_t i = 0; response[i]; i++) {
        size_t j = 0;
        while (key[j] && response[i + j] == key[j])
            j++;
        if (key[j])
            continue;

