fQwQf/A20OS/kernel/platform/stm32f103/bluetooth.c
        size_t pos = i + j;
        while (response[pos] == ':' || response[pos] == '=' ||
               response[pos] == '"' || response[pos] == ' ')
            pos++;
        size_t out = 0;
        while (response[pos] && response[pos] != '\r' &&
               response[pos] != '\n' && response[pos] != '"' &&
               out + 1U < capacity)
            value[out++] = response[pos++];
        value[out] = '\0';
        return out != 0;
    }
    return 0;
}

static int bluetooth_at_exchange(const char *command, char *response,
                                 size_t capacity, unsigned timeout_ms,
                                 int key_mode) {
    if (!command || !response || capacity < 2U)
        return -1;

    if (key_mode == STM32_BLUETOOTH_AT_KEY_LOW) {
        bluetooth_key_set(0);
    } else {
        bluetooth_key_set(1);
        bluetooth_delay_ms(BLUETOOTH_KEY_SETUP_MS);
    }
    bluetooth.at_attempts++;
    response[0] = '\0';
    bluetooth_uart_flush();
    for (size_t i = 0; command[i]; i++) {
        if (bluetooth_uart_send_byte((uint8_t)command[i]) != 0) {
            if (key_mode == STM32_BLUETOOTH_AT_KEY_PULSE)
                bluetooth_key_set(0);
            return -1;
        }
    }
    if (stm32_uart_wait_tx_complete(
            STM32_UART_USART3, BLUETOOTH_TX_TIMEOUT) != 0) {
        if (key_mode == STM32_BLUETOOTH_AT_KEY_PULSE)
            bluetooth_key_set(0);
        return -1;
    }
    /*
     * Match the PZ-HC05 vendor example exactly: KEY is only asserted while
     * issuing the command. Some PZ firmware does not answer while KEY remains
     * high for the whole response window.
     */
    if (key_mode == STM32_BLUETOOTH_AT_KEY_PULSE)
        bluetooth_key_set(0);

    size_t length = 0;
    unsigned idle_ms = 0;
    uint32_t error_bytes = 0;
    for (unsigned waited = 0; waited < timeout_ms; waited++) {
        int received = 0;
        for (;;) {
            uint8_t value;
            int result = stm32_uart_poll_byte(
                STM32_UART_USART3, &value);
            if (result == 0)
                break;
            if (result < 0) {
                error_bytes++;
                bluetooth.at_error_bytes++;
                continue;
            }
            received = 1;
            bluetooth.at_received_bytes++;
            if (length + 1U < capacity)
                response[length++] = (char)value;
        }
        if (received)
            idle_ms = 0;
        else if (length != 0 && ++idle_ms >= 20U)
            break;
        bluetooth_delay_ms(1U);
    }
    response[length] = '\0';
    bluetooth_log_response(command, response, length,
                           key_mode, error_bytes);
    return bluetooth_response_contains(response, "OK") ? 0 : -1;
}

static int bluetooth_at_command(const char *command, char *response,
                                size_t capacity) {
    for (unsigned attempt = 0; attempt < BLUETOOTH_AT_RETRIES; attempt++) {
        if (bluetooth_at_exchange(command, response, capacity,
                                  BLUETOOTH_AT_TIMEOUT_MS,
                                  bluetooth_at_key_mode) == 0)
            return 0;
        bluetooth_delay_ms(20U);
    }
    return -1;
}

static int bluetooth_reset_to_data_mode(char *response, size_t capacity) {
    static const char reset_command[] = "AT+RESET\r\n";

    if (!response || capacity < 2U)
        return -1;

    if (bluetooth_at_key_mode != STM32_BLUETOOTH_AT_KEY_LOW) {
        bluetooth_key_set(1);
        bluetooth_delay_ms(10U);
    } else {
        bluetooth_key_set(0);
    }
    bluetooth_uart_flush();
    for (size_t i = 0; reset_command[i]; i++) {
        if (bluetooth_uart_send_byte((uint8_t)reset_command[i]) != 0) {
            bluetooth_key_set(0);
            return -1;
        }
    }

    /*
     * KEY must be low when the module performs its software reset. Keeping
     * it high here boots standard HC-05 firmware straight back into full AT
     * mode, where phones cannot discover it.
     */
    if (stm32_uart_wait_tx_complete(
            STM32_UART_USART3, BLUETOOTH_TX_TIMEOUT) != 0) {
        bluetooth_key_set(0);
        return -1;
    }
    bluetooth_key_set(0);

    size_t length = 0;
    unsigned idle_ms = 0;
    for (unsigned waited = 0; waited < BLUETOOTH_AT_TIMEOUT_MS; waited++) {
        int received = 0;
        for (;;) {
            uint8_t value;
            int result = stm32_uart_poll_byte(
                STM32_UART_USART3, &value);
            if (result == 0)
                break;
            if (result < 0)
                continue;
            received = 1;
            if (length + 1U < capacity)
                response[length++] = (char)value;
        }
        if (received)
            idle_ms = 0;
        else if (length != 0 && ++idle_ms >= 20U)
            break;
        bluetooth_delay_ms(1U);
    }
    response[length] = '\0';

    /*
     * Some firmware resets before transmitting OK. The command was sent on
     * an already verified AT link, so silence is acceptable; an explicit
     * ERROR is not.
     */
    return bluetooth_response_contains(response, "ERROR") ? -1 : 0;
}

static int bluetooth_find_at_baud(char *response, size_t capacity) {
    static const uint32_t baud_rates[] = {
        9600U, 38400U, 115200U, 57600U, 19200U, 4800U,
    };

    for (unsigned i = 0; i < sizeof(baud_rates) / sizeof(baud_rates[0]);
         i++) {
        bluetooth_uart_set_baud(baud_rates[i]);
        bluetooth_delay_ms(20U);
        for (unsigned attempt = 0; attempt < BLUETOOTH_AT_RETRIES; attempt++) {
            if (bluetooth_at_exchange("AT\r\n", response, capacity,
                                      BLUETOOTH_AT_PROBE_TIMEOUT_MS,
                                      STM32_BLUETOOTH_AT_KEY_PULSE) == 0)
                return (int)baud_rates[i];
            bluetooth_delay_ms(20U);
        }
    }
    return -1;
}

static int bluetooth_enter_at_mode(char *response, size_t capacity,
                                   uint32_t *at_baud) {
    /*
     * The supplied PZ-HC05 example enters command mode at the transparent-data
     * baud by pulsing PA4 around each command. Try that path first. It works
     * after both a power cycle and a debugger-only MCU reset.
     */
    bluetooth_key_set(0);
    bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
    bluetooth_delay_ms(20U);
    if (bluetooth_at_exchange("AT\r\n", response, capacity,
                              BLUETOOTH_AT_TIMEOUT_MS,
                              STM32_BLUETOOTH_AT_KEY_PULSE) == 0) {
        bluetooth_delay_ms(20U);
        if (bluetooth_at_exchange("AT\r\n", response, capacity,
                                  BLUETOOTH_AT_TIMEOUT_MS,
                                  STM32_BLUETOOTH_AT_KEY_LOW) == 0)
            bluetooth_at_key_mode = STM32_BLUETOOTH_AT_KEY_LOW;
        else {
            bluetooth_key_set(1);
            bluetooth_delay_ms(20U);
            if (bluetooth_at_exchange("AT\r\n", response, capacity,
                                      BLUETOOTH_AT_TIMEOUT_MS,
                                      STM32_BLUETOOTH_AT_KEY_HIGH) == 0)
                bluetooth_at_key_mode = STM32_BLUETOOTH_AT_KEY_HIGH;
            else
                bluetooth_at_key_mode =
                    STM32_BLUETOOTH_AT_KEY_PULSE;
        }
        bluetooth.at_key_mode = bluetooth_at_key_mode;
        bluetooth.at_pulse_mode =
            bluetooth_at_key_mode == STM32_BLUETOOTH_AT_KEY_PULSE;
        bluetooth.at_power_on_mode = 0;
        *at_baud = BLUETOOTH_BAUD_RATE;
        return 0;
    }

    bluetooth_key_set(0);
    bluetooth_delay_ms(20U);
    int baud = bluetooth_find_at_baud(response, capacity);
    if (baud >= 0) {
        bluetooth_at_key_mode = STM32_BLUETOOTH_AT_KEY_PULSE;
        bluetooth.at_key_mode = bluetooth_at_key_mode;
        bluetooth.at_pulse_mode = 1;
        bluetooth.at_power_on_mode = 0;
        *at_baud = (uint32_t)baud;
        return 0;
    }

