fQwQf/A20OS/kernel/platform/stm32f103/bluetooth.c
    /*
     * Standard HC-05 firmware samples KEY during module power-on and exposes
     * full AT mode at 38400. If the module is already running in transparent
     * data mode, we can force it to re-enter AT mode by issuing AT+RESET
     * while KEY is held high; after the reset the module boots with KEY=1 and
     * stays in AT mode at 38400.
     */
    bluetooth_uart_set_baud(38400U);
    bluetooth_key_set(1);
    bluetooth_delay_ms(100U);
    if (bluetooth_at_exchange("AT\r\n", response, capacity,
                               BLUETOOTH_AT_TIMEOUT_MS,
                               STM32_BLUETOOTH_AT_KEY_HIGH) == 0) {
        bluetooth_at_key_mode = STM32_BLUETOOTH_AT_KEY_HIGH;
        bluetooth.at_key_mode = bluetooth_at_key_mode;
        bluetooth.at_pulse_mode = 0;
        bluetooth.at_power_on_mode = 1;
        *at_baud = 38400U;
        return 0;
    }

    printf("[BT-AT] key-high AT not responding; trying reset-into-AT mode\n");
    bluetooth_uart_flush();
    static const char reset_cmd[] = "AT+RESET\r\n";
    for (size_t i = 0; reset_cmd[i]; i++) {
        if (bluetooth_uart_send_byte((uint8_t)reset_cmd[i]) != 0) {
            bluetooth_key_set(0);
            return -1;
        }
    }
    if (stm32_uart_wait_tx_complete(
            STM32_UART_USART3, BLUETOOTH_TX_TIMEOUT) != 0) {
        bluetooth_key_set(0);
        return -1;
    }
    bluetooth_delay_ms(200U);

    for (unsigned waited = 0;
         waited < BLUETOOTH_RESET_ENTER_AT_TIMEOUT_MS;
         waited += 100U) {
        if (bluetooth_at_exchange("AT\r\n", response, capacity,
                                  BLUETOOTH_AT_TIMEOUT_MS,
                                  STM32_BLUETOOTH_AT_KEY_HIGH) == 0) {
            bluetooth_at_key_mode = STM32_BLUETOOTH_AT_KEY_HIGH;
            bluetooth.at_key_mode = bluetooth_at_key_mode;
            bluetooth.at_pulse_mode = 0;
            bluetooth.at_power_on_mode = 1;
            *at_baud = 38400U;
            return 0;
        }
        bluetooth_delay_ms(100U);
    }

    bluetooth_key_set(0);
    return -1;
}

static int bluetooth_set_and_verify(const char *set_command,
                                    const char *query_command,
                                    const char *key,
                                    const char *expected,
                                    char *response, size_t capacity) {
    char value[40];

    if (bluetooth_at_command(set_command, response, capacity) != 0)
        return 0;
    if (bluetooth_at_command(query_command, response, capacity) != 0)
        return 0;
    if (!bluetooth_response_value(response, key, value, sizeof(value)))
        return 0;
    return bluetooth_text_equal(value, expected);
}

static int bluetooth_set_pin(char *response, size_t capacity) {
    static const char pin_set[] =
        "AT+PSWD=" STM32_BLUETOOTH_PIN "\r\n";
    static const char pin_set_quoted[] =
        "AT+PSWD=\"" STM32_BLUETOOTH_PIN "\"\r\n";
    char pin[sizeof(bluetooth.pin)];

    if (bluetooth_at_command(pin_set, response, capacity) == 0 &&
        bluetooth_at_command("AT+PSWD?\r\n", response, capacity) == 0 &&
        bluetooth_response_value(response, "PSWD", pin, sizeof(pin))) {
        bluetooth_copy_text(bluetooth.pin, sizeof(bluetooth.pin), pin);
        if (bluetooth_text_equal(pin, STM32_BLUETOOTH_PIN))
            return 1;
    }

    /*
     * The second supplied example deliberately retries with quotes because
     * several HC-05 clone firmwares acknowledge the unquoted form without
     * actually changing the PIN.
     */
    if (bluetooth_at_command(pin_set_quoted, response, capacity) != 0 ||
        bluetooth_at_command("AT+PSWD?\r\n", response, capacity) != 0 ||
        !bluetooth_response_value(response, "PSWD", pin, sizeof(pin)))
        return 0;
    bluetooth_copy_text(bluetooth.pin, sizeof(bluetooth.pin), pin);
    return bluetooth_text_equal(pin, STM32_BLUETOOTH_PIN);
}

static int bluetooth_set_name(char *response, size_t capacity) {
    static const char name_set[] =
        "AT+NAME=" STM32_BLUETOOTH_DEVICE_NAME "\r\n";
    char name[sizeof(bluetooth.device_name)];

    if (bluetooth_at_command(name_set, response, capacity) != 0 ||
        bluetooth_at_command("AT+NAME?\r\n", response, capacity) != 0 ||
        !bluetooth_response_value(response, "NAME", name, sizeof(name)))
        return 0;
    bluetooth_copy_text(bluetooth.device_name,
                        sizeof(bluetooth.device_name), name);
    return bluetooth_text_equal(name, STM32_BLUETOOTH_DEVICE_NAME);
}

static void bluetooth_configure_uuid(char *response, size_t capacity) {
    static const char uuid_set[] =
        "AT+UUID=" STM32_BLUETOOTH_SERVICE_UUID_TEXT "\r\n";
    char uuid_text[16];
    int valid = 0;

    bluetooth.service_uuid = 0;
    bluetooth.uuid_supported = 0;
    bluetooth.uuid_configured = 0;
    if (bluetooth_at_command(uuid_set, response, capacity) != 0) {
        bluetooth.service_uuid = 0x1101U;
        return;
    }
    bluetooth.uuid_supported = 1;
    if (bluetooth_at_command("AT+UUID?\r\n", response, capacity) != 0 ||
        !bluetooth_response_value(response, "UUID",
                                  uuid_text, sizeof(uuid_text)))
        return;
    uint16_t uuid = bluetooth_parse_uuid(uuid_text, &valid);
    if (!valid)
        return;
    bluetooth.service_uuid = uuid;
    bluetooth.uuid_configured = uuid == bluetooth.requested_uuid;
}

static int bluetooth_set_uart(uint32_t at_baud, char *response,
                              size_t capacity) {
    static const char uart_set[] =
        "AT+UART=" STM32_BLUETOOTH_BAUD_RATE_TEXT ",0,0\r\n";
    static const char uart_expected[] =
        STM32_BLUETOOTH_BAUD_RATE_TEXT ",0,0";
    char value[40];

    if (bluetooth_at_command(uart_set, response, capacity) != 0)
        return 0;
    if (bluetooth_at_command("AT+UART?\r\n", response, capacity) == 0 &&
        bluetooth_response_value(response, "UART", value, sizeof(value)) &&
        bluetooth_text_equal(value, uart_expected))
        return 1;

    bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
    if (bluetooth_at_command("AT+UART?\r\n", response, capacity) == 0) {
        if (bluetooth_response_value(
                response, "UART", value, sizeof(value)) &&
            bluetooth_text_equal(value, uart_expected))
            return 1;
    }
    bluetooth_uart_set_baud(at_baud);
    return 0;
}

static int bluetooth_configure(void) {
    char response[BLUETOOTH_AT_RESPONSE_MAX];

