fQwQf/A20OS/kernel/platform/stm32f103/bluetooth.c
    /*
     * Re-probe after the module boot delay. Some HC-05 modules do not drive
     * their TX pin until they have finished their own power-on sequence, so an
     * early probe can report floating even when the module is wired correctly.
     */
    bluetooth.rx_line_state = bluetooth_probe_rx_line();
    bluetooth.detected =
        bluetooth_rx_line_is_present(bluetooth.rx_line_state) ||
        bluetooth.detected;

    int configured = 0;
    for (unsigned attempt = 0; attempt <= BLUETOOTH_INIT_RETRIES; attempt++) {
        configured = bluetooth_configure() == 0;
        if (configured)
            break;
        if (attempt < BLUETOOTH_INIT_RETRIES) {
            printf("[BT] configuration attempt %u failed, retrying in %u ms\n",
                   attempt + 1U,
                   (unsigned)BLUETOOTH_INIT_RETRY_DELAY_MS);
            bluetooth_key_set(0);
            stm32_uart_set_rx_irq(STM32_UART_USART3, 0);
            bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
            bluetooth_uart_flush();
            bluetooth_delay_ms(BLUETOOTH_INIT_RETRY_DELAY_MS);
        }
    }

    bluetooth.connected = 0;
    bluetooth_state_high =
        !!(GPIOA_IDR & (1U << BLUETOOTH_STATE_PIN));
    /*
     * A driven-high module TX pin is a real electrical detection even when
     * its firmware does not answer the supported AT dialect. Keep USART3
     * armed in that case, but never claim that slave configuration was
     * verified.
     */
    bluetooth.ready = bluetooth.detected || bluetooth.at_responsive;
    bluetooth.waiting = configured;
    stm32_uart_set_rx_irq(STM32_UART_USART3, bluetooth.ready);
    return bluetooth.ready ? 0 : -1;
#endif
}

int stm32_bluetooth_reprobe(void) {
#ifndef CONFIG_STM32_XUANWU
    return -1;
#else
    if (bluetooth.connected)
        return 0;

    bluetooth_key_set(0);
    bluetooth_delay_ms(20U);
    bluetooth.rx_line_state = bluetooth_probe_rx_line();
    bluetooth.detected =
        bluetooth_rx_line_is_present(bluetooth.rx_line_state);
    stm32_uart_set_rx_irq(STM32_UART_USART3, 0);
    bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
    bluetooth_key_set(0);
    bluetooth_delay_ms(20U);
    int configured = bluetooth_configure() == 0;
    bluetooth.ready = bluetooth.detected || bluetooth.at_responsive;
    bluetooth.waiting = configured;
    bluetooth.connected = 0;
    bluetooth_state_high =
        !!(GPIOA_IDR & (1U << BLUETOOTH_STATE_PIN));
    bluetooth_state_changed_time = 0;
    stm32_uart_set_rx_irq(STM32_UART_USART3, bluetooth.ready);
    return bluetooth.ready ? 0 : -1;
#endif
}

void stm32_bluetooth_irq(void) {
    if (!bluetooth.ready)
        return;

    for (;;) {
        uint8_t value;
        int result = stm32_uart_poll_byte(STM32_UART_USART3, &value);
        if (result == 0)
            break;
        if (result < 0) {
            bluetooth.dropped_bytes++;
            continue;
        }

        unsigned next = (bluetooth_rx_head + 1U) % BLUETOOTH_RX_SIZE;
        if (next == bluetooth_rx_tail) {
            bluetooth.dropped_bytes++;
            continue;
        }
        bluetooth_rx[bluetooth_rx_head] = value;
        bluetooth_rx_head = next;
        bluetooth.received_bytes++;
        if (value == '\n')
            bluetooth_frame_ready = 1;
    }
}

void stm32_bluetooth_service(uint64_t now) {
    if (!bluetooth.ready)
        return;

    int state_high = !!(GPIOA_IDR & (1U << BLUETOOTH_STATE_PIN));
    if (state_high != bluetooth_state_high) {
        bluetooth_state_high = state_high;
        bluetooth_state_changed_time = now;
    } else if (state_high && !bluetooth.connected &&
               now - bluetooth_state_changed_time >=
                   BLUETOOTH_CONNECT_ASSERT_MS) {
        bluetooth.connected = 1;
    } else if (!state_high && bluetooth.connected &&
               now - bluetooth_state_changed_time >=
                   BLUETOOTH_DISCONNECT_ASSERT_MS) {
        bluetooth.connected = 0;
    }
    bluetooth.waiting =
        bluetooth.slave_mode && bluetooth.discoverable &&
        bluetooth.name_configured && bluetooth.pin_configured &&
        bluetooth.reset_performed && !bluetooth.connected;

    if (bluetooth_observed_rx != bluetooth.received_bytes) {
        bluetooth_observed_rx = bluetooth.received_bytes;
        bluetooth_last_rx_time = now;
    } else if (bluetooth_rx_head != bluetooth_rx_tail &&
               now - bluetooth_last_rx_time >= BLUETOOTH_FRAME_IDLE_MS) {
        bluetooth_frame_ready = 1;
    }
}

int stm32_bluetooth_connected(void) {
    return bluetooth.ready && bluetooth.connected;
}

int stm32_bluetooth_send(const void *data, size_t length) {
#ifndef CONFIG_STM32_XUANWU
    (void)data;
    (void)length;
    return -1;
#else
    if (!bluetooth.ready || !bluetooth.connected || (!data && length))
        return -1;

    const uint8_t *bytes = data;
    for (size_t i = 0; i < length; i++) {
        if (bluetooth_uart_send_byte(bytes[i]) != 0)
            return -1;
    }
    if (stm32_uart_wait_tx_complete(
            STM32_UART_USART3, BLUETOOTH_TX_TIMEOUT) != 0)
        return -1;
    bluetooth.transmitted_bytes += (uint32_t)length;
    return 0;
#endif
}

int stm32_bluetooth_send_text(const char *text) {
    if (!text)
        return -1;
    size_t length = 0;
    while (text[length])
        length++;
    return stm32_bluetooth_send(text, length);
}

int stm32_bluetooth_read_line(char *buffer, size_t capacity) {
    if (!buffer || capacity < 2U || !bluetooth.ready ||
        !bluetooth_frame_ready)
        return 0;

    uint32_t flags = arch_irq_save();
    size_t length = 0;
    int complete = 0;

    while (bluetooth_rx_tail != bluetooth_rx_head) {
        uint8_t value = bluetooth_rx[bluetooth_rx_tail];
        bluetooth_rx_tail = (bluetooth_rx_tail + 1U) % BLUETOOTH_RX_SIZE;
        if (length + 1U < capacity)
            buffer[length++] = (char)value;
        if (value == '\n') {
            complete = 1;
            break;
        }
    }
    bluetooth_frame_ready = bluetooth_buffer_has_newline();
    arch_irq_restore(flags);

    if (!complete && bluetooth_rx_tail != bluetooth_rx_head)
        bluetooth_frame_ready = 1;
    buffer[length] = '\0';
    return (int)length;
}

const stm32_bluetooth_info_t *stm32_bluetooth_info(void) {
    return &bluetooth;
}

