fQwQf/A20OS/kernel/platform/stm32f103/bluetooth.c
void stm32_bluetooth_debug_status(void) {
    static const char *const rx_states[] = {
        "unknown", "driven-high", "floating", "driven-low",
    };
    unsigned rx_state = (unsigned)bluetooth.rx_line_state;
    if (rx_state >= sizeof(rx_states) / sizeof(rx_states[0]))
        rx_state = 0;

    printf("[BT-DIAG] ready=%d detected=%d rx-line=%s"
           " at=%d at-mode=%s boot-at=%d at-baud=%u data-baud=%u"
           " attempts=%u at-rx=%u at-errors=%u"
           " configured=%d role=%s waiting=%d connected=%d"
           " name=%s pin=%s uuid=0x%x\n",
           bluetooth.ready, bluetooth.detected, rx_states[rx_state],
           bluetooth.at_responsive,
           bluetooth.at_key_mode == STM32_BLUETOOTH_AT_KEY_PULSE ?
               "key-pulse" :
           bluetooth.at_key_mode == STM32_BLUETOOTH_AT_KEY_HIGH ?
               "key-high" : "key-low",
           bluetooth.at_power_on_mode,
           (unsigned)bluetooth.at_baud_rate,
           (unsigned)bluetooth.baud_rate,
           (unsigned)bluetooth.at_attempts,
           (unsigned)bluetooth.at_received_bytes,
           (unsigned)bluetooth.at_error_bytes,
           bluetooth.configured,
           bluetooth.slave_mode ? "slave" : "unknown",
           bluetooth.waiting, bluetooth.connected,
           bluetooth.device_name[0] ? bluetooth.device_name : "<empty>",
           bluetooth.pin[0] ? bluetooth.pin : "<empty>",
           (unsigned)bluetooth.service_uuid);
}

int stm32_bluetooth_debug_probe(void) {
#ifndef CONFIG_STM32_XUANWU
    return -1;
#else
    char response[BLUETOOTH_AT_RESPONSE_MAX];
    int rx_irq_enabled =
        stm32_uart_rx_irq_enabled(STM32_UART_USART3);

    printf("[BT-DIAG] probing runtime KEY-pulse AT modes\n");
    stm32_uart_set_rx_irq(STM32_UART_USART3, 0);
    bluetooth_key_set(0);
    bluetooth_delay_ms(20U);
    int at_baud = bluetooth_find_at_baud(response, sizeof(response));
    bluetooth_key_set(0);
    bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
    bluetooth_uart_flush();
    stm32_uart_set_rx_irq(STM32_UART_USART3, rx_irq_enabled);

    if (at_baud < 0) {
        printf("[BT-DIAG] probe failed: no valid OK response\n");
        return -1;
    }
    printf("[BT-DIAG] probe success: baud=%u\n", (unsigned)at_baud);
    return 0;
#endif
}

int stm32_bluetooth_debug_at(const char *command) {
#ifndef CONFIG_STM32_XUANWU
    (void)command;
    return -1;
#else
    if (!command || command[0] != 'A' || command[1] != 'T')
        return -1;

    char command_line[64];
    size_t length = 0;
    while (command[length] && length + 3U < sizeof(command_line)) {
        command_line[length] = command[length];
        length++;
    }
    command_line[length++] = '\r';
    command_line[length++] = '\n';
    command_line[length] = '\0';

    char response[BLUETOOTH_AT_RESPONSE_MAX];
    int rx_irq_enabled =
        stm32_uart_rx_irq_enabled(STM32_UART_USART3);
    stm32_uart_set_rx_irq(STM32_UART_USART3, 0);
    bluetooth_key_set(0);
    bluetooth_delay_ms(20U);
    int at_baud = bluetooth_find_at_baud(response, sizeof(response));
    if (at_baud < 0) {
        bluetooth_key_set(0);
        bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
        stm32_uart_set_rx_irq(STM32_UART_USART3, rx_irq_enabled);
        printf("[BT-DIAG] cannot send command: AT mode not found\n");
        return -1;
    }

    bluetooth_uart_set_baud((uint32_t)at_baud);
    int result = bluetooth_at_exchange(
        command_line, response, sizeof(response),
        BLUETOOTH_AT_TIMEOUT_MS, STM32_BLUETOOTH_AT_KEY_PULSE);
    bluetooth_key_set(0);
    bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
    bluetooth_uart_flush();
    stm32_uart_set_rx_irq(STM32_UART_USART3, rx_irq_enabled);
    return result;
#endif
}

#endif
